# Ch.3 Pandas

In [40]:
import pandas as pd

In [41]:
pd.__version__

'2.2.2'

## Pandas Series 객체
+ 인덱싱된 데이터의 1차원 배열
+ 인덱스와 값을 가지고 있음
+ 인덱스의 존재여부가 Numpy와의 차이점
+ 파이썬의 딕셔너리와 비슷 (인덱스 : 밸류)

In [42]:
series = pd.Series([0.25, 0.5, 0.75, 1.0])
series

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [43]:
print("인덱스 : ",series.index)
print("밸류 : ",series.values)

인덱스 :  RangeIndex(start=0, stop=4, step=1)
밸류 :  [0.25 0.5  0.75 1.  ]

#### 인덱스 임의 지정 및 접근

In [44]:
a = pd.Series([0.25, 0.5, 0.75, 1.0],index=['a','b','x','y'])
a

a    0.25
b    0.50
x    0.75
y    1.00
dtype: float64

#### 길이, 인덱스 접근, 슬라이싱

In [45]:
len(a), a['x'], a['b':'x']

(4,
 0.75,
 b    0.50
 x    0.75
 dtype: float64)

### Pandas - Python dict 연동

In [48]:
population_dict = {'Seoul' : 11111111,
                   'Busan' : 22222222,
                   'Daegu' : 33333333,
                   'Incheon' : 55555555
                  }
population_series = pd.Series(population_dict)
print(population_series)
print("서울 : ",population_series['Seoul'])

Seoul      11111111
Busan      22222222
Daegu      33333333
Incheon    55555555
dtype: int64
서울 :  11111111

#### Pandas - Numpy 연동

In [34]:
import numpy as np
ndata = np.array([1,2,3])
pd.Series(ndata)

0    1
1    2
2    3
dtype: int32

## Pandas DataFrame 객체
+ 2차원 배열

In [69]:
area_dict = {'Seoul' : 5555,
                   'Busan' : 6666,
                   'Daegu' : 7777,
                   'Incheon' : 8888
            }
state = pd.DataFrame({'population' : population_series, 'area':area_dict})
state

         population  area
Seoul      11111111  5555
Busan      22222222  6666
Daegu      33333333  7777
Incheon    55555555  8888

In [56]:
state.index

Index(['Seoul', 'Busan', 'Daegu', 'Incheon'], dtype='object')

In [67]:
state.area

Seoul      5555
Busan      6666
Daegu      7777
Incheon    8888
Name: area, dtype: int64

### DataFrame 생성 방법
1. Series 객체로 생성
2. 딕셔너리 리스트로 생성

In [79]:
# 시리즈 객체로 생성
pd.DataFrame(population_series,columns=['인구수'])

              인구수
Seoul    11111111
Busan    22222222
Daegu    33333333
Incheon  55555555

In [94]:
# 딕셔너리로 생성
data = [{'a':i, 'b':i**2} for i in range(1,5)]
pdata = pd.DataFrame(data)
print(pdata)

print(pdata.index)

   a   b
0  1   1
1  2   4
2  3   9
3  4  16
RangeIndex(start=0, stop=4, step=1)

In [96]:
pdata['a']

0    1
1    2
2    3
3    4
Name: a, dtype: int64

## Pandas로 CSV 파일 분석
+ DataFrame 객체로 읽어옴
+ pd.read_csv('경로')
+ head() / tail()
+ info() / describe()

In [151]:
df = pd.read_csv('data/president_heights.csv')
df.head(), df.tail(), type(df)

(   order               name  height(cm)
 0      1  George Washington         189
 1      2         John Adams         170
 2      3   Thomas Jefferson         189
 3      4      James Madison         163
 4      5       James Monroe         183,
     order               name  height(cm)
 37     40      Ronald Reagan         185
 38     41  George H. W. Bush         188
 39     42       Bill Clinton         188
 40     43     George W. Bush         182
 41     44       Barack Obama         185,
 pandas.core.frame.DataFrame)

In [107]:
np.average(df['height(cm)'])

179.73809523809524

In [111]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 42 entries, 0 to 41
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   order       42 non-null     int64
 1   name        42 non-null     object
 2   height(cm)  42 non-null     int64
dtypes: int64(2), object(1)
memory usage: 1.1+ KB

In [114]:
# CSV 파일의 통계를 간략히 볼때 사용
df.describe()

           order  height(cm)
count  42.000000   42.000000
mean   22.476190  179.738095
std    13.152461    7.015869
min     1.000000  163.000000
25%    11.250000  174.250000
50%    22.000000  182.000000
75%    33.750000  183.000000
max    44.000000  193.000000

## Pandas Index 객체
+ 정렬된 집합
    - 집합 연산 (교집합, 차집합 등) 가능 - intersection / union / difference
+ 일반적으로 값을 바꿀 수 없음

In [118]:
idx = pd.Index([2,3,5,7,11])
idx

Index([2, 3, 5, 7, 11], dtype='int64')

In [121]:
idx[1], idx[::2]

(3, Index([2, 5, 11], dtype='int64'))

### 명시적 인덱스는 최종 인덱스가 포함되지만 암묵적 인덱스는 포함되지 않음
+ loc => Pandas의 명시적 인덱스 슬라이싱 (지정된 인덱스 값)
+ iloc => Pandas의 암묵적 인덱스 슬라이싱 (인덱스 순서), DataFrame 타입으로 반환됨

In [178]:
idata = pd.Series([1,2,3,4,5,6,7],index=['a','b','c','d','e','f','g'])
idata['a':'c']

a    1
b    2
c    3
dtype: int64

In [164]:
idata [0:2]

a    1
b    2
dtype: int64

In [172]:
idata.loc['a':'c']

a    1
b    2
c    3
dtype: int64

In [246]:
idata.iloc[0:2]

a    1
b    2
dtype: int64

### Series 객체는 Python 딕셔너리 내장 함수와 연동 가능

In [156]:
idata.keys(), idata.values, 'a' in idata

(Index(['a', 'b', 'c', 'd', 'e', 'f', 'g'], dtype='object'),
 array([1, 2, 3, 4, 5, 6, 7], dtype=int64),
 True)

In [150]:
list(idata.items())

[('a', 1), ('b', 2), ('c', 3), ('d', 4), ('e', 5), ('f', 6), ('g', 7)]

In [157]:
idata > 4

a    False
b    False
c    False
d    False
e     True
f     True
g     True
dtype: bool

In [180]:
titanic_df = pd.read_csv('https://raw.githubusercontent.com/mwaskom/seaborn-data/master/titanic.csv')
titanic_df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [185]:
titanic_df.survived == 1

0      False
1       True
2       True
3       True
4      False
       ...
886    False
887     True
888    False
889     True
890    False
Name: survived, Length: 891, dtype: bool

In [207]:
# 단일 인덱스로 접근 -> 해당하는 행을 반환
titanic_df[0:5]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [205]:
# '인덱스' 로 접근 -> 해당하는 열을 반환
titanic_df['survived']

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True

In [224]:
# 인덱싱을 합칠 수도 있음 -> survived 열을 0~9까지 출력
titanic_df['survived'][0:10]

0    0
1    1
2    1
3    1
4    0
5    0
6    0
7    0
8    1
9    1
Name: survived, dtype: int64

In [230]:
# 마스킹 + 팬시 인덱싱
titanic_df.loc[titanic_df.age>50, ['survived']]

     survived
6           0
11          1
15          1
33          0
54          0
..        ...
820         1
829         1
851         0
857         1
879         1

[64 rows x 1 columns]

In [242]:
state['pop/area'] = state.population / state.area
state, state.shape

(         population  area     pop/area
 Seoul      11111111  5555  2000.200000
 Busan      22222222  6666  3333.666667
 Daegu      33333333  7777  4286.142857
 Incheon    55555555  8888  6250.625000,
 (4, 3))

In [244]:
# 배열의 행과 열을 뒤집기
state.T

                 Seoul         Busan         Daegu       Incheon
population  11111111.0  2.222222e+07  3.333333e+07  5.555556e+07
area            5555.0  6.666000e+03  7.777000e+03  8.888000e+03
pop/area        2000.2  3.333667e+03  4.286143e+03  6.250625e+03

In [265]:
state.iloc[0:3,1:3]

       area     pop/area
Seoul  5555  2000.200000
Busan  6666  3333.666667
Daegu  7777  4286.142857

In [268]:
state.loc['Seoul':'Busan', 'population':'area']

       population  area
Seoul    11111111  5555
Busan    22222222  6666

In [274]:
A = np.random.RandomState(42).randint(10, size=(3,4))
A
# 브로드캐스팅 - A의 모든 행에서 A[0] 행을 뺀 결과와 같음
A-A[0]

array([[ 0,  0,  0,  0],
       [ 0,  6, -5,  2],
       [ 1,  1, -4,  3]])

#### Pandas의 브로드캐스팅

In [277]:
df = pd.DataFrame(A, columns=list('asdf'))
df - df.iloc[0]

   a  s  d  f
0  0  0  0  0
1  0  6 -5  2
2  1  1 -4  3

#### Pandas는 인덱스를 기준으로 정렬하고 연산

In [295]:
A = pd.Series([2,3,6],index=[0,1,2])
B = pd.Series([1,3,5],index=[1,2,3])
A.add(B)

0    NaN
1    4.0
2    9.0
3    NaN
dtype: float64

## 누락된 데이터(Null) 처리하기 (NaN, NA, None)
+ Pandas에는 null 표기법이 없음
+ isnull() 과 notnull()로 null 값을 확인 가능
+ dropna() 로 null 값이 있는 모든 행을 삭제 가능 (axis = 1을 주게 되면 모든 열을 삭제) -> 추천하지 않음
+ fillna() 로 null 값을 임의의 값으로 채운 복사본 반환 가능 (숫자 입력시 float 타입, 문자열 입력시 object 타입)
+ ffill(), bfill() 로 앞의 값 / 뒤의 값을 가져와서 채우기 가능

In [305]:
A.add(B).fillna(0)

0    0.0
1    4.0
2    9.0
3    0.0
dtype: float64

In [302]:
A.add(B).isnull()

0     True
1    False
2    False
3     True
dtype: bool

In [303]:
A.add(B).notnull()

0    False
1     True
2     True
3    False
dtype: bool

In [304]:
A.add(B).dropna()

1    4.0
2    9.0
dtype: float64

In [307]:
A.add(B).ffill()

0    NaN
1    4.0
2    9.0
3    9.0
dtype: float64

In [309]:
A.add(B).bfill()

0    4.0
1    4.0
2    9.0
3    NaN
dtype: float64

In [313]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    object
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    object
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), float64(2), int64(4), object(7)
memory usage: 92.4+ KB

In [320]:
age_titanic_df = titanic_df.age.fillna(np.mean(titanic_df.age))
age_titanic_df.info()

<class 'pandas.core.series.Series'>
RangeIndex: 891 entries, 0 to 890
Series name: age
Non-Null Count  Dtype
--------------  -----
891 non-null    float64
dtypes: float64(1)
memory usage: 7.1 KB

In [325]:
new_titanic_df = titanic_df
new_titanic_df.age = age_titanic_df
new_titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          891 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    object
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    object
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), float64(2), int64(4), object(7)
memory usage: 92.4+ KB